/**
 * 计算两个时间的间隔
 * @param {Number} e - 开始时间戳
 * @param {Number} t - 结束时间戳
 * @return {String} - 1,12,15,13 天时分秒  过期返回空
 */
module.exports = (e, t) => {
  var r = [0, 0, 0, 0],
    n = "",
    o = t > e ? parseInt((t - e) / 1e3) : 0;
  return (
    (r[0] = o > 86400 ? parseInt(o / 86400) : 0),
    (o -= 86400 * r[0]),
    (r[1] = o > 3600 ? parseInt(o / 3600) : 0),
    (o -= 3600 * r[1]),
    (r[2] = o > 60 ? parseInt(o / 60) : 0),
    (r[3] = o - 60 * r[2]),
    (n = r[0] > 0 ? r[0] + "," : ""),
    (n += r[0] <= 0 && r[1] <= 0 ? "" : r[1] + ","),
    (n += r[0] <= 0 && r[1] <= 0 && r[2] <= 0 ? "" : r[2] + ","),
    (n += r[0] <= 0 && r[1] <= 0 && r[2] <= 0 && r[3] <= 0 ? "" : r[3])
  );
};
